// Generated by jextract

package com.jenet.enet.cpp;

import java.lang.invoke.MethodHandle;
import java.lang.invoke.VarHandle;
import java.nio.ByteOrder;
import java.lang.foreign.*;
import static java.lang.foreign.ValueLayout.*;
public class _ENetPeer {

    static final  GroupLayout $struct$LAYOUT = MemoryLayout.structLayout(
        MemoryLayout.structLayout(
            Constants$root.C_POINTER$LAYOUT.withName("next"),
            Constants$root.C_POINTER$LAYOUT.withName("previous")
        ).withName("dispatchList"),
        Constants$root.C_POINTER$LAYOUT.withName("host"),
        Constants$root.C_SHORT$LAYOUT.withName("outgoingPeerID"),
        Constants$root.C_SHORT$LAYOUT.withName("incomingPeerID"),
        Constants$root.C_LONG$LAYOUT.withName("connectID"),
        Constants$root.C_CHAR$LAYOUT.withName("outgoingSessionID"),
        Constants$root.C_CHAR$LAYOUT.withName("incomingSessionID"),
        MemoryLayout.paddingLayout(16),
        MemoryLayout.structLayout(
            Constants$root.C_LONG$LAYOUT.withName("host"),
            Constants$root.C_SHORT$LAYOUT.withName("port"),
            MemoryLayout.paddingLayout(16)
        ).withName("address"),
        MemoryLayout.paddingLayout(32),
        Constants$root.C_POINTER$LAYOUT.withName("data"),
        Constants$root.C_LONG$LAYOUT.withName("state"),
        MemoryLayout.paddingLayout(32),
        Constants$root.C_POINTER$LAYOUT.withName("channels"),
        Constants$root.C_LONG_LONG$LAYOUT.withName("channelCount"),
        Constants$root.C_LONG$LAYOUT.withName("incomingBandwidth"),
        Constants$root.C_LONG$LAYOUT.withName("outgoingBandwidth"),
        Constants$root.C_LONG$LAYOUT.withName("incomingBandwidthThrottleEpoch"),
        Constants$root.C_LONG$LAYOUT.withName("outgoingBandwidthThrottleEpoch"),
        Constants$root.C_LONG$LAYOUT.withName("incomingDataTotal"),
        Constants$root.C_LONG$LAYOUT.withName("outgoingDataTotal"),
        Constants$root.C_LONG$LAYOUT.withName("lastSendTime"),
        Constants$root.C_LONG$LAYOUT.withName("lastReceiveTime"),
        Constants$root.C_LONG$LAYOUT.withName("nextTimeout"),
        Constants$root.C_LONG$LAYOUT.withName("earliestTimeout"),
        Constants$root.C_LONG$LAYOUT.withName("packetLossEpoch"),
        Constants$root.C_LONG$LAYOUT.withName("packetsSent"),
        Constants$root.C_LONG$LAYOUT.withName("packetsLost"),
        Constants$root.C_LONG$LAYOUT.withName("packetLoss"),
        Constants$root.C_LONG$LAYOUT.withName("packetLossVariance"),
        Constants$root.C_LONG$LAYOUT.withName("packetThrottle"),
        Constants$root.C_LONG$LAYOUT.withName("packetThrottleLimit"),
        Constants$root.C_LONG$LAYOUT.withName("packetThrottleCounter"),
        Constants$root.C_LONG$LAYOUT.withName("packetThrottleEpoch"),
        Constants$root.C_LONG$LAYOUT.withName("packetThrottleAcceleration"),
        Constants$root.C_LONG$LAYOUT.withName("packetThrottleDeceleration"),
        Constants$root.C_LONG$LAYOUT.withName("packetThrottleInterval"),
        Constants$root.C_LONG$LAYOUT.withName("pingInterval"),
        Constants$root.C_LONG$LAYOUT.withName("timeoutLimit"),
        Constants$root.C_LONG$LAYOUT.withName("timeoutMinimum"),
        Constants$root.C_LONG$LAYOUT.withName("timeoutMaximum"),
        Constants$root.C_LONG$LAYOUT.withName("lastRoundTripTime"),
        Constants$root.C_LONG$LAYOUT.withName("lowestRoundTripTime"),
        Constants$root.C_LONG$LAYOUT.withName("lastRoundTripTimeVariance"),
        Constants$root.C_LONG$LAYOUT.withName("highestRoundTripTimeVariance"),
        Constants$root.C_LONG$LAYOUT.withName("roundTripTime"),
        Constants$root.C_LONG$LAYOUT.withName("roundTripTimeVariance"),
        Constants$root.C_LONG$LAYOUT.withName("mtu"),
        Constants$root.C_LONG$LAYOUT.withName("windowSize"),
        Constants$root.C_LONG$LAYOUT.withName("reliableDataInTransit"),
        Constants$root.C_SHORT$LAYOUT.withName("outgoingReliableSequenceNumber"),
        MemoryLayout.paddingLayout(16),
        MemoryLayout.structLayout(
            MemoryLayout.structLayout(
                Constants$root.C_POINTER$LAYOUT.withName("next"),
                Constants$root.C_POINTER$LAYOUT.withName("previous")
            ).withName("sentinel")
        ).withName("acknowledgements"),
        MemoryLayout.structLayout(
            MemoryLayout.structLayout(
                Constants$root.C_POINTER$LAYOUT.withName("next"),
                Constants$root.C_POINTER$LAYOUT.withName("previous")
            ).withName("sentinel")
        ).withName("sentReliableCommands"),
        MemoryLayout.structLayout(
            MemoryLayout.structLayout(
                Constants$root.C_POINTER$LAYOUT.withName("next"),
                Constants$root.C_POINTER$LAYOUT.withName("previous")
            ).withName("sentinel")
        ).withName("sentUnreliableCommands"),
        MemoryLayout.structLayout(
            MemoryLayout.structLayout(
                Constants$root.C_POINTER$LAYOUT.withName("next"),
                Constants$root.C_POINTER$LAYOUT.withName("previous")
            ).withName("sentinel")
        ).withName("outgoingReliableCommands"),
        MemoryLayout.structLayout(
            MemoryLayout.structLayout(
                Constants$root.C_POINTER$LAYOUT.withName("next"),
                Constants$root.C_POINTER$LAYOUT.withName("previous")
            ).withName("sentinel")
        ).withName("outgoingUnreliableCommands"),
        MemoryLayout.structLayout(
            MemoryLayout.structLayout(
                Constants$root.C_POINTER$LAYOUT.withName("next"),
                Constants$root.C_POINTER$LAYOUT.withName("previous")
            ).withName("sentinel")
        ).withName("dispatchedCommands"),
        Constants$root.C_LONG$LAYOUT.withName("needsDispatch"),
        Constants$root.C_SHORT$LAYOUT.withName("incomingUnsequencedGroup"),
        Constants$root.C_SHORT$LAYOUT.withName("outgoingUnsequencedGroup"),
        MemoryLayout.sequenceLayout(32, Constants$root.C_LONG$LAYOUT).withName("unsequencedWindow"),
        Constants$root.C_LONG$LAYOUT.withName("eventData"),
        MemoryLayout.paddingLayout(32),
        Constants$root.C_LONG_LONG$LAYOUT.withName("totalWaitingData")
    ).withName("_ENetPeer");
    public static MemoryLayout $LAYOUT() {
        return _ENetPeer.$struct$LAYOUT;
    }
    public static MemorySegment dispatchList$slice(MemorySegment seg) {
        return seg.asSlice(0, 16);
    }
    static final VarHandle host$VH = $struct$LAYOUT.varHandle(MemoryLayout.PathElement.groupElement("host"));
    public static VarHandle host$VH() {
        return _ENetPeer.host$VH;
    }
    public static MemoryAddress host$get(MemorySegment seg) {
        return (java.lang.foreign.MemoryAddress)_ENetPeer.host$VH.get(seg);
    }
    public static void host$set( MemorySegment seg, MemoryAddress x) {
        _ENetPeer.host$VH.set(seg, x);
    }
    public static MemoryAddress host$get(MemorySegment seg, long index) {
        return (java.lang.foreign.MemoryAddress)_ENetPeer.host$VH.get(seg.asSlice(index*sizeof()));
    }
